import React from 'react'
import { FaRegUserCircle } from 'react-icons/fa';
import elogo from '../../assets/images/Logo/event.png'

function EventDtail() {
    const rulesInfo = [
        {
            name: 'Innovatia Project Display (Science,Business,IT)',
            cons: ['সেগমেন্টটি তিনটি গ্রুপে সম্পন্ন হবে।', 'প্রতিটি দলে সর্বোচ্চ ৪ জন সদস্য থাকতে পারবে।', 'প্রত্যেক সদস্যকে আলাদাভাবে রেজিস্ট্রেশন করতে হবে।', 'টিমে একাধিক সদস্য থাকলে ভেন্যুতে আসার পর ইভেন্ট কর্তৃপক্ষের কাছে সকল সদস্যকে একসাথে রিপোর্ট করতে হবে।', 'উপরে উল্লেখিত ০৩ টি বিষয়ের মধ্যে প্রজেক্টটি যেকোনো একটি বিষয় সম্পর্কিত হতে হবে। ', 'প্রতি সদস্যের জন্য রেজিট্রেশন ফি ১৫০/- টাকা মাত্র। ', 'এই সেগমেন্টটিতে এককভাবে বা দলগত ভাবে অংশগ্রহন করা যাবে।', 'ভেন্যুতে আসার পর নিজের প্রজেক্টি নিজ দায়িত্বে রাখতে হবে। কোনো ক্ষতি হলে কতৃপক্ষ দায়ী থাকবে না।', 'বিজয়ীদের আকর্ষনীয় পুরষ্কার প্রদান করা হবে।' ],
        },
        {
            name: 'Lens Legends Photography exhibition (Camera & Mobile)',
            cons: ['সেগমেন্টটি তিনটি গ্রুপে সম্পন্ন হবে। ', 'ছবিগুলো আমাদের অফিশিয়াল মেইলে (spscevents24@gmail.com) ২০/০১/২০২৪ তারিখের মধ্যে প্রেরণ করতে হবে। ', 'অবশ্যই ডিভাইসের নাম, প্রতিযোগীর নাম এবং রেজিস্টার ফোন নাম্বার উল্লেখ করতে হবে। অন্যথায় ছবিটি বাতিল বলে গণ্য হবে। ', 'বিজয়ীদের আকর্ষনীয় পুরষ্কার প্রদান করা হবে।']
        },
        {
            name: 'Canva Quest Art Challenge',
            cons: ['সেগমেন্টটি তিনটি গ্রুপে সম্পন্ন হবে।', 'প্রতিযোগিতার সময় থাকবে ১ ঘন্টা।', 'চিত্রাঙ্কনের জন্য আর্টপেপার ইভেন্ট কর্তৃপক্ষ প্রদান করবে এবং অন্যান্য প্রয়োজনীয় সরঞ্জাম নিজেদের নিয়ে আসতে হবে। ', 'বিজয়ীদের আকর্ষনীয় পুরষ্কার প্রদান করা হবে।']
        },
        {
            name: 'Enigma Explorer Treasure Hunt',
            cons: ['সেগমেন্টটি তিনটি গ্রুপে সম্পন্ন  হবে।', 'প্রতিটি দলে সর্বোচ্চ ৪ জন সদস্য থাকতে পারবে।', 'প্রত্যেক সদস্যকে আলাদাভাবে রেজিস্ট্রেশন করতে হবে।', ' টিমে একাধিক সদস্য থাকলে ভেন্যুতে আসার পর ইভেন্ট কতৃপক্ষের কাছে সকল সদস্যকে একসাথে রিপোর্ট করতে হবে।', 'প্রতি সদস্যের জন্য রেজিট্রেশন ফি ১৫০/- টাকা মাত্র। ', 'প্রতিযোগীদের একটি ৫০ নম্বরের পরীক্ষা নেওয়া হবে।', 'পরীক্ষার সময় থাকবে এক ঘন্টা। ', 'পরীক্ষায় মুভি (Titanic, Marvel, Disney, Pixar, Harry Potter) সম্পর্কিত প্রশ্ন থাকবে। ', 'ফাইনাল রাউন্ডে শীর্ষ ৫ দলকে বিভিন্ন clue এর মাধ্যমে ভেন্যুতে একটি নির্দিষ্ট জিনিস খুঁজে বের করতে হবে।', 'বিজয়ীদের আকর্ষনীয় পুরষ্কার প্রদান করা হবে। ']
        },
        {
            name: `Groove gala dance floor (Modern & Folk)`,
            cons: ['সেগমেন্টটি তিনটি গ্রুপে সম্পন্ন  হবে।', 'প্রতিটি নাচের জন্য সর্বোচ্চ সময় দেওয়া হবে ০৩ মিনিট।', 'ভেন্যুতে আসার পরে ইভেন্ট কর্তৃপক্ষকে গানের নাম ও ধরন অবহিত করতে হবে।', ' ভেন্যুতে আসার পর নাচের সরঞ্জাম নিজ দায়িত্বে রাখতে হবে।', 'নাচ পরিবেশনের সময় মার্জিত পোশাক পরিধান করতে হবে। ', 'অপ্রাসঙ্গিক নাচ উপস্থাপন করা যাবে না।', 'পরীক্ষার সময় থাকবে এক ঘন্টা। ', 'বিজয়ীদেরকে মঞ্চে নাচ পরিবেশন করার সুযোগ প্রদান করা হবে। ', 'বিজয়ীদের আকর্ষনীয় পুরষ্কার প্রদান করা হবে। ']
        },
        {
            name: 'Story Telling - Bangla',
            cons: ['সেগমেন্টটি তিনটি গ্রুপে সম্পন্ন  হবে।', 'গল্প বলার জন্য একজনকে সর্বোচ্চ ০৩ মিনিট সময় দেওয়া হবে।', 'পূর্ববর্তী প্রতিযোগীর গল্প যেখানে শেষ হবে পরবর্তী প্রতিযোগীকে সেখান থেকে গল্প বলা শুরু করতে হবে।', 'বিজয়ীদের মঞ্চে গল্প বলার সুযোগ দেওয়া হবে। ',  'বিজয়ীদের আকর্ষনীয় পুরষ্কার প্রদান করা হবে। ']
        },
        {
            name: 'Story Writing - Bangla',
            cons: ['সেগমেন্টটি তিনটি গ্রুপে সম্পন্ন  হবে।', 'গল্প ৫০০ শব্দের মধ্যে হতে হবে। ', 'গল্পের নাম দিতে হবে।', 'গল্প আমাদের অফিশিয়াল মেইলে (spscevents24@gmail.com) ২০/০১/২০২৪ তারিখের মধ্যে পিডিএফ আকারে প্রেরণ করতে হবে। ', 'অবশ্যই গল্পের সাথে প্রতিযোগির নাম এবং রেজিস্টার ফোন নাম্বার উল্লেখ করতে হবে। অন্যথায় গল্পটি বাতিল বলে গণ্য হবে।', 'একজন সর্বোচ্চ ০১ টি গল্প পাঠাতে পারবে।',  'বিজয়ীদের আকর্ষনীয় পুরষ্কার প্রদান করা হবে। ']
        },
        {
            name: 'Al-Khwarizmi Math Olympiad',
            cons: ['সেগমেন্টটি তিনটি গ্রুপে সম্পন্ন  হবে।', 'গল্প ৫০০ শব্দের মধ্যে হতে হবে। ', 'এটি একটি একক প্রতিযোগিতা।', 'MCQ আকারে ৫০ নম্বরের পরীক্ষা নেওয়া হবে।', 'প্রতিটি প্রশ্নের জন্য ০১ নম্বর বরাদ্দ', 'পরীক্ষার সময় ০১ ঘন্টা।', 'কলম ও ক্যালকুলেটর (যেকোনো ক্যালকুলেটর) নিজ দায়িত্বে নিয়ে আসতে হবে।', 'কোনো মাইনাস মার্কিং থাকবে না।' ,'বিজয়ীদের আকর্ষনীয় পুরষ্কার প্রদান করা হবে। ']
        },
        {
            name: "Rubik's Cube",
            cons: ['সেগমেন্টটি তিনটি গ্রুপে সম্পন্ন  হবে।', 'গল্প ৫০০ শব্দের মধ্যে হতে হবে। ', 'নিজেদেরকে সাথে করে কিউব আনতে হবে।' ,'বিজয়ীদের আকর্ষনীয় পুরষ্কার প্রদান করা হবে। ']
        },
        {
            name: 'Silver screen Film making',
            cons: ['সেগমেন্টটি তিনটি গ্রুপে সম্পন্ন  হবে।', 'ভিডিওগুলো আমাদের অফিশিয়াল মেইলে (spscevents24@gmail.com) ২০/০১/২০২৪ তারিখের মধ্যে প্রেরণ করতে হবে।  ', 'ভিডিওর সময়সীমা ২ মিনিট ৩০ সেকেন্ডের মধ্যে হতে হবে।' ,'ভিডিওগুলোতে কোনো প্রকার রাজনৈতিক, দেশবিরোধী ফুটেজ, স্ক্রিপ্ট থাকা যাবেনা। ','ভিডিওগুলো মার্জিত হতে হবে।','অবশ্যই প্রতিযোগীর নাম এবং রেজিস্টার ফোন নাম্বার উল্লেখ করতে হবে। অন্যথায় ভিডিওটি বাতিল বলে গণ্য হবে।', 'বিজয়ীদের আকর্ষনীয় পুরষ্কার প্রদান করা হবে। ']
        },
        {
            name: 'Quizzical Conclave quiz (Gk)',
            cons: ['সেগমেন্টটি তিনটি গ্রুপে সম্পন্ন  হবে।',  'এটি একটি একক প্রতিযোগিতা।', 'MCQ আকারে ৫০ নম্বরের পরীক্ষা নেওয়া হবে।', 'প্রতিটি প্রশ্নের জন্য ০১ নম্বর বরাদ্দ', 'পরীক্ষার সময় ০১ ঘন্টা।',  'কোনো মাইনাস মার্কিং থাকবে না।' ,'শীর্ষ ০৫ প্রতিযোগীর মধ্যে ফাইনার রাউন্ড বাজার সিস্টেমে মঞ্চে অনুষ্ঠিত হবে।','বিজয়ীদের আকর্ষনীয় পুরষ্কার প্রদান করা হবে। ']
        },
        {
            name: "Queen's Gambit chess",
            cons: ['সেগমেন্টটি তিনটি গ্রুপে সম্পন্ন  হবে।',  'ইভেন্ট কর্তৃপক্ষ চেজ বোর্ড ও অন্যান্য উপকরণ প্রদান করবে।', 'MCQ আকারে ৫০ নম্বরের পরীক্ষা নেওয়া হবে।', 'প্রতিটি প্রশ্নের জন্য ০১ নম্বর বরাদ্দ', 'সেগমেন্টটির জন্য নির্ধারিত সময়সীমা থাকবে। যা পরবর্তীতে জানিয়ে দেওয়া হবে।','বিজয়ীদের আকর্ষনীয় পুরষ্কার প্রদান করা হবে। ']
        },
        {
            name: 'Singing Maestro (Modern & Folk)',
            cons: ['সেগমেন্টটি তিনটি গ্রুপে সম্পন্ন  হবে।',  'প্রতিটি গানের জন্য সর্বোচ্চ সময় দেওয়া হবে ০৩ মিনিট।', 'ভেন্যুতে আসার পরে ইভেন্ট কর্তৃপক্ষকে গানের নাম ও ধরন অবহিত করতে হবে।', 'অপ্রাসঙ্গিক গান উপস্থাপন করা যাবে না।', 'বিজয়ীদেরকে মঞ্চে গান পরিবেশন করার সুযোগ প্রদান করা হবে।','বিজয়ীদের আকর্ষনীয় পুরষ্কার প্রদান করা হবে। ']
        },
        {
            name: 'Rapid Rhetoric Extempore Speech (Bangla & English)',
            cons: ['সেগমেন্টটি তিনটি গ্রুপে সম্পন্ন  হবে।',  'বক্তব্যের জন্য সময় দেওয়া হবে ০৩ মিনিট।', 'স্পিচের টপিক পরবর্তীতে জানানো হবে।', 'অপ্রাসঙ্গিক গান উপস্থাপন করা যাবে না।', 'বিজয়ীদের মঞ্চে কথা বলার সুযোগ দেওয়া হবে।','বিজয়ীদের আকর্ষনীয় পুরষ্কার প্রদান করা হবে। ']
        },
    ]
    return (
        <>
            <div className='max-w-[1200px] mx-auto px-3 xl:px-0 py-14 '>
                <div className="text-center pb-16">
                    <p className="flex justify-center items-center gap-1 text-sm text-violet-800 font-semibold">
                        <span>
                            <FaRegUserCircle />
                        </span>নিয়মাবলি
                    </p>
                    <h1 className="text-4xl sm:text-5xl font-semibold mt-2">আমাদের সকল ইভেন্টের নিয়মাবলি</h1>
                </div>

                <div className="bg-violet-900 text-white text-justify px-4 md:px-12 py-12 rounded-md mb-8">
                    <div className=" mx-auto mb-4">
                        <img src={elogo} className='h-[3.5rem] w-fit mx-auto' alt="Ninish Logo" />
                    </div>
                    {
                        rulesInfo.map((rules, index) => <div key={index}>
                            <p className='text-2xl m-2 font-bold text-center'>{rules.name}</p>
                            <ul className='list-disc m-4'>
                                {
                                   rules.cons &&  rules.cons.map((rule, index) => <li key={index}>{rule}</li>)
                                }
                            </ul>

                        </div>)
                    }

                </div>
            </div>
        </>
    )
}

export default EventDtail;